In [1]:
import pandas as pd

In [2]:
DIS_df = pd.read_csv('DIS.csv')

In [3]:
DIS_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2010-01-01,32.500000,32.750000,28.709999,29.549999,25.738926,232174700
1,2010-02-01,29.600000,31.520000,28.990000,31.240000,27.210964,230552400
2,2010-03-01,31.400000,35.599998,31.340000,34.910000,30.407646,306740800
3,2010-04-01,35.070000,37.490002,35.009998,36.840000,32.088741,237911900
4,2010-05-01,36.950001,37.980000,31.000000,33.419998,29.109810,381609800

In [4]:
DIS_df = DIS_df.rename(columns = {'Adj Close': 'DIS'})
DIS_df.head()

,Date,Open,High,Low,Close,DIS,Volume
0,2010-01-01,32.500000,32.750000,28.709999,29.549999,25.738926,232174700
1,2010-02-01,29.600000,31.520000,28.990000,31.240000,27.210964,230552400
2,2010-03-01,31.400000,35.599998,31.340000,34.910000,30.407646,306740800
3,2010-04-01,35.070000,37.490002,35.009998,36.840000,32.088741,237911900
4,2010-05-01,36.950001,37.980000,31.000000,33.419998,29.109810,381609800

In [6]:
DIS_clean = DIS_df[['Date','DIS']]
DIS_clean.head()

         Date        DIS
0  2010-01-01  25.738926
1  2010-02-01  27.210964
2  2010-03-01  30.407646
3  2010-04-01  32.088741
4  2010-05-01  29.109810

In [7]:
len(DIS_clean)

120

In [8]:
len(DIS_clean.dropna())

120